{
  "extractedAt": "2026-01-13T12:00:00.000Z",
  "studyId": "gxs-app-store-study",
  "totalInsights": 25,
  "insights": [
    {
      "id": "INS-001",
      "title": "Users cannot add GXS cards to Apple Pay or Google Pay digital wallets",
      "category": "Pain Point",
      "impactLevel": "High",
      "confidenceLevel": "High",
      "evidence": "\"Can't use on Apple pay in this day and age.\" - cocodna, iOS Q1 2025 | \"Not bad. But Can't add to Apple Wallet or pay NETS.\" - Roq0m, iOS Q2 2025 | \"Integration with Apple Pay only thing left to make it great\" - aj)@;/7, iOS Q2 2025 | \"The GXS FLEXICARD...Only thing is cannot add to mobile phone.must everytime take out physical card\" - MOHAMAD NOH BIN AMIR, Play Store Q1 2025",
      "source": "gxs_ios_q125.md, gxs_ios_q225.md, gxs_ps_q125.md",
      "recommendedActions": "1. Prioritize Apple Pay and Google Pay integration as a key product feature. 2. Communicate timeline to users if in development.",
      "productArea": "Payments",
      "customerSegment": "All Users",
      "tags": ["apple-pay", "google-pay", "digital-wallet", "feature-request", "high-priority"]
    },
    {
      "id": "INS-002",
      "title": "Accounts are frozen or blocked without prior notification or clear explanation",
      "category": "Pain Point",
      "impactLevel": "High",
      "confidenceLevel": "High",
      "evidence": "\"My account was suddenly blocked and I couldn't transfer any funds...There was no notification that they will hold my account\" - ÂLEIUEÑ, iOS Q1 2025 | \"just blocks your account without informing. say under review then ONE MONTH later then can put in funds\" - Alex Jacelyn Cheng, Play Store Q1 2025 | \"3 months already and my account is still freezed. Talked to their so call chat almost every week also no use\" - Karthik Spartan, Play Store Q1 2025",
      "source": "gxs_ios_q125.md, gxs_ps_q125.md, gxs_ps_q225.md",
      "recommendedActions": "1. Implement proactive notification system before account restrictions. 2. Provide clear, specific reasons for account reviews. 3. Set and communicate expected resolution timelines.",
      "productArea": "Account Management",
      "customerSegment": "All Users",
      "tags": ["account-freeze", "trust", "communication", "transparency", "critical"]
    },
    {
      "id": "INS-003",
      "title": "Customer service is unresponsive with long wait times and unhelpful resolutions",
      "category": "Pain Point",
      "impactLevel": "High",
      "confidenceLevel": "High",
      "evidence": "\"waited 2 hours for chat support to respond, proceeds to disconnect you in 5 mins due to inactivity\" - bry09753, iOS Q2 2025 | \"Customer service sucks. Transfers out $500 at 540 am and now it's 630 pm. No response over chat or hotline, forever engaged\" - Jason Yap, Play Store Q1 2025 | \"customer service will listen and no action to resolve the issue\" - Kishen The Boss, Play Store Q2 2025",
      "source": "gxs_ios_q225.md, gxs_ps_q125.md, gxs_ps_q225.md",
      "recommendedActions": "1. Reduce chat support wait times and extend inactivity timeout. 2. Implement callback functionality during high volume periods. 3. Empower support staff with more resolution authority.",
      "productArea": "Customer Support",
      "customerSegment": "All Users",
      "tags": ["customer-service", "wait-times", "support", "frustration"]
    },
    {
      "id": "INS-004",
      "title": "Bank account linking feature broken - no banks appear in selection dropdown",
      "category": "Bug Report",
      "impactLevel": "High",
      "confidenceLevel": "High",
      "evidence": "\"After an update, totally can't transfer money into the account. Tried linking bank also no option to select banks at all, no bank name showing\" - Rick Peh, Play Store Q1 2025 | \"encountered same problem with others, couldn't link bank account. wouldn't show list of banks for confirm selection, full of bugs!!!\" - phil mu, Play Store Q1 2025 | \"I can't link my account. When I keep trying to select which bank to link, that particular page does not have any option popping up\" - Aiswarya S, Play Store Q1 2025",
      "source": "gxs_ps_q125.md",
      "recommendedActions": "1. Investigate and fix bank linking dropdown bug immediately. 2. Implement automated testing for critical flows before releases. 3. Add fallback mechanism for bank selection.",
      "productArea": "Onboarding",
      "customerSegment": "New Users",
      "tags": ["bug", "bank-linking", "critical", "onboarding"]
    },
    {
      "id": "INS-005",
      "title": "Users feel trapped by hidden withdrawal limits and 12-hour cooling periods",
      "category": "Pain Point",
      "impactLevel": "High",
      "confidenceLevel": "High",
      "evidence": "\"Unable to withdraw money, transfer limit is pretty much a gimmick, take note if you are intending to transfer a large sum into the account\" - fh_30, iOS Q2 2025 | \"This triggered the 12h cooling off period and I was unable to transfer out my funds\" - Chong Er Chua, Play Store Q2 2025 | \"Take note of hidden withdrawal limit by bank that overwrites your own set daily limit. If you want to try to open the account and put in funds to try out, note that there is a 10k daily hidden withdrawal limit for 14 days\" - Hwee Siang Neo, Play Store Q2 2025",
      "source": "gxs_ios_q225.md, gxs_ps_q225.md",
      "recommendedActions": "1. Clearly disclose all withdrawal limits during onboarding. 2. Allow users to request limit increases through verified process. 3. Provide countdown timer for cooling-off periods in app.",
      "productArea": "Transfers",
      "customerSegment": "All Users",
      "tags": ["withdrawal-limits", "transparency", "trust", "liquidity"]
    },
    {
      "id": "INS-006",
      "title": "Interest rates have declined significantly causing user dissatisfaction",
      "category": "Pain Point",
      "impactLevel": "High",
      "confidenceLevel": "High",
      "evidence": "\"Been using GXS for the past 1year and all has been well until recently updated and realised the interest rates have gone from 2.8% to 2.08% to NOW 1.98%\" - Saverholic, iOS Q2 2025 | \"Very disappointed with GXS with the decreasing interest rates!!!! At this rate, it'll soon reach 0.01%!!!!\" - HM Wong, Play Store Q2 2025 | \"Interest rate sucks now. Put money else where\" - Jin Yu Chan, Play Store Q2 2025",
      "source": "gxs_ios_q225.md, gxs_ps_q225.md",
      "recommendedActions": "1. Communicate rate changes proactively before implementation. 2. Offer loyalty bonuses or tiered rates for long-term customers. 3. Explore alternative value propositions beyond interest rates.",
      "productArea": "Savings",
      "customerSegment": "Savers",
      "tags": ["interest-rates", "pricing", "retention", "competition"]
    },
    {
      "id": "INS-007",
      "title": "Promotion terms are unclear leading to users missing rewards",
      "category": "Pain Point",
      "impactLevel": "Medium",
      "confidenceLevel": "High",
      "evidence": "\"Entered into a 3 mth savings promo via boost savings pocket. When I enquired why I did not receive any reward. Bank cited that I did not meet eligibility criteria as funds were withdrawn too soon. No where in the terms was it stated that funds needed to be held till 2359 on the day of holding period end\" - Jfxkgc, iOS Q1 2025 | \"launched a credit card but can't provide details with the terms for cash back and promo? links provided in the email went to page 404\" - alvin goh, Play Store Q2 2025",
      "source": "gxs_ios_q125.md, gxs_ps_q225.md",
      "recommendedActions": "1. Simplify promotion terms and make eligibility criteria explicit. 2. Add in-app tracking showing promotion progress and requirements. 3. Test all promotional links before campaign launch.",
      "productArea": "Marketing",
      "customerSegment": "All Users",
      "tags": ["promotions", "clarity", "trust", "communication"]
    },
    {
      "id": "INS-008",
      "title": "Scratch card rewards are perceived as misleading with underwhelming actual payouts",
      "category": "Pain Point",
      "impactLevel": "Medium",
      "confidenceLevel": "Medium",
      "evidence": "\"The promotional messaging suggests that scratch cards up to $10 cashback are given, but the actual rewards are underwhelming. Most rewards apps typically offer at least $0.10 to $1, while GXS scratch cards average at like literally $0.02 lol\" - cocodna, iOS Q1 2025",
      "source": "gxs_ios_q125.md",
      "recommendedActions": "1. Review scratch card reward distribution to be more competitive. 2. Set realistic expectations in promotional messaging. 3. Consider minimum reward thresholds.",
      "productArea": "Rewards",
      "customerSegment": "All Users",
      "tags": ["rewards", "expectations", "gamification", "disappointment"]
    },
    {
      "id": "INS-009",
      "title": "App crashes and displays errors frequently after updates",
      "category": "Bug Report",
      "impactLevel": "High",
      "confidenceLevel": "High",
      "evidence": "\"The app keep crashing\" - Shun Teo, Play Store Q1 2025 | \"lousy app. feels very buggy\" - Terence Koh, Play Store Q2 2025 | \"can't even log into the app\" - Alex Toh, Play Store Q2 2025 | \"after update, can't transfer funds from dbs or ocbc anymore. Keep saying error\" - Zixx, Play Store Q1 2025",
      "source": "gxs_ps_q125.md, gxs_ps_q225.md",
      "recommendedActions": "1. Implement comprehensive regression testing before releases. 2. Add crash reporting and monitoring. 3. Establish rollback procedures for critical bugs.",
      "productArea": "App Stability",
      "customerSegment": "All Users",
      "tags": ["bugs", "crashes", "stability", "updates"]
    },
    {
      "id": "INS-010",
      "title": "App blocks usage when Android developer mode is enabled",
      "category": "Pain Point",
      "impactLevel": "Medium",
      "confidenceLevel": "High",
      "evidence": "\"Keep telling you to disable Developer Option. Inform once is enough\" - Dexter Ang, Play Store Q2 2025 | \"Stop asking me to disable developer options. Other banking apps don't ask this either\" - Aditia Nugraha, Play Store Q2 2025 | \"Blocks usage if developer mode is enabled. No other local bank app has this requirement\" - Yx Chua, Play Store Q2 2025",
      "source": "gxs_ps_q225.md",
      "recommendedActions": "1. Reduce frequency of developer mode warnings to once per session. 2. Allow basic functionality while developer mode is on. 3. Benchmark against competitor banking apps' security approaches.",
      "productArea": "Security",
      "customerSegment": "Android Users",
      "tags": ["developer-mode", "android", "security", "ux-friction"]
    },
    {
      "id": "INS-011",
      "title": "Pockets system is confusing - users don't understand difference between account types",
      "category": "Pain Point",
      "impactLevel": "Medium",
      "confidenceLevel": "Medium",
      "evidence": "\"so many pockets to choose is confusing. Why need to create so many pockets for different reasons why not just straight forward put fixed deposit 3 month or 6 month? What's difference between the main account and savings pockets and boost pockets?\" - Kopidess, iOS Q2 2025 | \"a bit confusing of the funds allocation from saving account to pockets\" - Lin Jacq, Play Store Q2 2025",
      "source": "gxs_ios_q225.md, gxs_ps_q225.md",
      "recommendedActions": "1. Add clear explainer content differentiating pocket types. 2. Simplify naming conventions. 3. Create interactive tutorial for new users.",
      "productArea": "Savings",
      "customerSegment": "New Users",
      "tags": ["pockets", "confusion", "onboarding", "ux"]
    },
    {
      "id": "INS-012",
      "title": "Users unable to register new accounts - registration process hangs",
      "category": "Bug Report",
      "impactLevel": "High",
      "confidenceLevel": "Medium",
      "evidence": "\"Cannot register new Account,keep Said wait a Moment,try Many times still Cannot register\" - yyeyyu, iOS Q1 2025 | \"Why cannot sign up?\" - Conscientious 1111, Play Store Q1 2025",
      "source": "gxs_ios_q125.md, gxs_ps_q125.md",
      "recommendedActions": "1. Monitor registration funnel for failure points. 2. Add retry mechanism with clear error messages. 3. Implement registration status checking.",
      "productArea": "Onboarding",
      "customerSegment": "New Users",
      "tags": ["registration", "onboarding", "bug", "conversion"]
    },
    {
      "id": "INS-013",
      "title": "Age restriction excluding users over 55 years old frustrates potential customers",
      "category": "Unmet Need",
      "impactLevel": "Medium",
      "confidenceLevel": "Low",
      "evidence": "\"This is not good at all because it doesn't allow those over 55 years of age. It should let those who are over 55 years of age.\" - gwendolen20, iOS Q1 2025",
      "source": "gxs_ios_q125.md",
      "recommendedActions": "1. Review and communicate rationale for age restrictions. 2. Consider expanding eligible age range. 3. Provide alternative products for excluded segments.",
      "productArea": "Onboarding",
      "customerSegment": "Seniors",
      "tags": ["age-restriction", "accessibility", "inclusion"]
    },
    {
      "id": "INS-014",
      "title": "Account blocked while traveling overseas leaves users stranded without access to funds",
      "category": "Pain Point",
      "impactLevel": "High",
      "confidenceLevel": "Medium",
      "evidence": "\"I was at oversea and forgot to topup money inside due to insufficient balance .my acc being suspected as fraud and they said they will investigated within 24hrs\" - Gxuserlyn, iOS Q1 2025 | \"Everything was great...until my account was suddenly unable to use while I was overseas. Fortunately, I had my WISE card with me as a backup. Imagine being stranded without funds while abroad\" - 弾塚ライアン（Rai）, Play Store Q2 2025",
      "source": "gxs_ios_q125.md, gxs_ps_q225.md",
      "recommendedActions": "1. Add travel notification feature in app. 2. Implement less aggressive fraud detection for known travel patterns. 3. Provide emergency contact for travelers with blocked accounts.",
      "productArea": "Security",
      "customerSegment": "Travelers",
      "tags": ["travel", "fraud-detection", "overseas", "emergency"]
    },
    {
      "id": "INS-015",
      "title": "Fraud and unauthorized transaction disputes are handled poorly",
      "category": "Pain Point",
      "impactLevel": "High",
      "confidenceLevel": "Medium",
      "evidence": "\"Bank has very low security protocol. I had a fraudulent on my card and the way they handle it was highly unacceptable\" - Shermz.Yoda, iOS Q1 2025 | \"Don't bother to use this bank. Can't fully get back your money for unauthorised transactions like most banks do\" - Jungrnb, iOS Q1 2025 | \"GXS Bank's handling of disputed charges is extremely disappointing. They fail to resolve issues with merchants\" - Panaché Panache, Play Store Q1 2025",
      "source": "gxs_ios_q125.md, gxs_ps_q125.md",
      "recommendedActions": "1. Review and improve dispute resolution SLAs. 2. Benchmark dispute handling against traditional banks. 3. Provide clearer communication throughout dispute process.",
      "productArea": "Security",
      "customerSegment": "All Users",
      "tags": ["fraud", "disputes", "security", "trust"]
    },
    {
      "id": "INS-016",
      "title": "SME/Business accounts lack essential features like PayNow and CPF payments",
      "category": "Unmet Need",
      "impactLevel": "Medium",
      "confidenceLevel": "Medium",
      "evidence": "\"If you're a SME in singapore, I highly discouraged the use of its biz account for many reasons: 1. Difficulty in receiving and sending payment Need to pay CPF? Sorry. It has no paynow function to pay others\" - Sm Wane, Play Store Q1 2025",
      "source": "gxs_ps_q125.md",
      "recommendedActions": "1. Add PayNow send functionality for business accounts. 2. Enable CPF payment support. 3. Audit business account feature gaps against market needs.",
      "productArea": "Business Banking",
      "customerSegment": "SME",
      "tags": ["business", "sme", "paynow", "cpf", "feature-gap"]
    },
    {
      "id": "INS-017",
      "title": "eGIRO service outage lasted over a week with poor communication",
      "category": "Bug Report",
      "impactLevel": "High",
      "confidenceLevel": "Medium",
      "evidence": "\"7 days after eGIRO service became unavailable customer service kept replying there is no information on what was the issue and when it will get restored. On the 8th day customer service replied work is ongoing\" - Choon Hau Lua, Play Store Q1 2025",
      "source": "gxs_ps_q125.md",
      "recommendedActions": "1. Improve service status communication during outages. 2. Implement service status page for users. 3. Establish incident communication protocols with defined update intervals.",
      "productArea": "Payments",
      "customerSegment": "All Users",
      "tags": ["egiro", "outage", "communication", "reliability"]
    },
    {
      "id": "INS-018",
      "title": "Users request cash deposit and ATM withdrawal capabilities",
      "category": "Unmet Need",
      "impactLevel": "Medium",
      "confidenceLevel": "High",
      "evidence": "\"one thing they need to do is being able to deposit cash into the bank or take out cash it would make the bank easily one of the best banks out there\" - hakim534, iOS Q1 2025 | \"Digital bank is easy to manage but flaws could exist if u needed cash, no other way to withdraw like atm\" - Nick Peh, Play Store Q1 2025 | \"Hopefully in the near future the debit card can be used to withdraw cash at atms locally\" - Syed Al Jufri, Play Store Q1 2025",
      "source": "gxs_ios_q125.md, gxs_ps_q125.md",
      "recommendedActions": "1. Explore ATM network partnerships for cash withdrawal. 2. Investigate cash deposit solutions (network or retail partners). 3. Communicate roadmap for cash services if planned.",
      "productArea": "Payments",
      "customerSegment": "All Users",
      "tags": ["atm", "cash", "withdrawal", "deposit", "feature-request"]
    },
    {
      "id": "INS-019",
      "title": "Debit card cannot be used for NETS or MRT payments",
      "category": "Pain Point",
      "impactLevel": "Medium",
      "confidenceLevel": "Medium",
      "evidence": "\"one thing I am unhappy about is the debit card because you can't paywave much using nets and sometimes I can't even use it on the mrt\" - Hudzaifah Jamil, Play Store Q2 2025",
      "source": "gxs_ps_q225.md",
      "recommendedActions": "1. Enable NETS functionality on debit cards. 2. Ensure compatibility with transit payment systems. 3. Clearly communicate card limitations to users before card issuance.",
      "productArea": "Payments",
      "customerSegment": "All Users",
      "tags": ["nets", "mrt", "transit", "debit-card"]
    },
    {
      "id": "INS-020",
      "title": "App shows device incompatible error on latest Android versions",
      "category": "Bug Report",
      "impactLevel": "Medium",
      "confidenceLevel": "Medium",
      "evidence": "\"App can't be used on android 14\" - Muz Monkey, Play Store Q1 2025 | \"unusable,keep show your device is incompatible on lastest version update\" - Gan Kelvin, Play Store Q2 2025",
      "source": "gxs_ps_q125.md, gxs_ps_q225.md",
      "recommendedActions": "1. Test app on latest Android versions before release. 2. Quickly patch compatibility issues. 3. Provide clear instructions when device incompatibility is legitimate.",
      "productArea": "App Stability",
      "customerSegment": "Android Users",
      "tags": ["android", "compatibility", "bug", "device"]
    },
    {
      "id": "INS-021",
      "title": "Users request logout option on home screen for quick access",
      "category": "Unmet Need",
      "impactLevel": "Low",
      "confidenceLevel": "Low",
      "evidence": "\"Possible to have logout option in home screen?\" - pmkpillai76, iOS Q1 2025",
      "source": "gxs_ios_q125.md",
      "recommendedActions": "1. Add quick logout option to home screen or settings shortcut. 2. Survey users on most-wanted quick actions.",
      "productArea": "User Experience",
      "customerSegment": "All Users",
      "tags": ["logout", "ux", "accessibility", "quick-action"]
    },
    {
      "id": "INS-022",
      "title": "App interface described as boring with request for more creative design",
      "category": "Unmet Need",
      "impactLevel": "Low",
      "confidenceLevel": "Low",
      "evidence": "\"Very nice digital bank but it would be better if you can be more creative with the app. Sorry to say the app is boring and black\" - Marliyah, iOS Q1 2025",
      "source": "gxs_ios_q125.md",
      "recommendedActions": "1. Consider adding theme/customization options. 2. Explore dark/light mode toggle. 3. Research competitor app designs for inspiration.",
      "productArea": "User Experience",
      "customerSegment": "All Users",
      "tags": ["design", "ui", "themes", "customization"]
    },
    {
      "id": "INS-023",
      "title": "Users appreciate the easy-to-use interface and pockets feature for money management",
      "category": "Positive Feedback",
      "impactLevel": "High",
      "confidenceLevel": "High",
      "evidence": "\"Love the GXS Interface, Easy to use and see everything at a glance!\" - iamcleooon, iOS Q1 2025 | \"The UI/UX is miles ahead of the bigger incumbents tbh and I really like the savings pockets feature\" - aj)@;/7, iOS Q2 2025 | \"easy to use and safe\" - Enrique Yuen, Play Store Q1 2025 | \"the features such as 'pockets' has helped me manage my money well\" - hakim534, iOS Q1 2025",
      "source": "gxs_ios_q125.md, gxs_ios_q225.md, gxs_ps_q125.md",
      "recommendedActions": "1. Maintain and enhance the intuitive UX as competitive advantage. 2. Continue developing pockets feature based on user feedback. 3. Use positive UI feedback in marketing materials.",
      "productArea": "User Experience",
      "customerSegment": "All Users",
      "tags": ["ux", "pockets", "positive", "satisfaction"]
    },
    {
      "id": "INS-024",
      "title": "Fast transaction processing is valued by users",
      "category": "Positive Feedback",
      "impactLevel": "Medium",
      "confidenceLevel": "Medium",
      "evidence": "\"Transaction very first\" - thein86, iOS Q2 2025 | \"Good banking app\" - David Teo, Play Store Q1 2025 | \"Very Straight Forward Instructions On Application And Approval\" - Tasha Omar, Play Store Q1 2025",
      "source": "gxs_ios_q225.md, gxs_ps_q125.md",
      "recommendedActions": "1. Maintain transaction speed as a key performance metric. 2. Highlight speed in user communications. 3. Monitor for any degradation in transaction times.",
      "productArea": "Payments",
      "customerSegment": "All Users",
      "tags": ["speed", "transactions", "positive", "performance"]
    },
    {
      "id": "INS-025",
      "title": "Loan application process is frustrating with repeated rejections despite marketing claims",
      "category": "Pain Point",
      "impactLevel": "Medium",
      "confidenceLevel": "Medium",
      "evidence": "\"can't even approve the loan..but still advertising on saying no limit to approve\" - Muhammad Ramadan, Play Store Q1 2025 | \"not an easy app to apply for loan...very troublesome\" - Rainbow Gal, Play Store Q2 2025 | \"3 min approval is a blatant lie - can take hours, and days\" - Peter Lee, Play Store Q2 2025 | \"it's annoying to sign up for their flexicard... received an edm from my school email stating that students above 21 can sign up with no minimum income, but when I tried signing up, it just kept rejecting me\" - Gary Chia, Play Store Q2 2025",
      "source": "gxs_ps_q125.md, gxs_ps_q225.md",
      "recommendedActions": "1. Align marketing claims with actual approval criteria. 2. Provide clear feedback on rejection reasons. 3. Offer alternative products when primary application is rejected.",
      "productArea": "Lending",
      "customerSegment": "Loan Applicants",
      "tags": ["loans", "marketing", "expectations", "rejection"]
    }
  ]
}
